MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C12C0AGN20000/mcu.h
#define FM_BT4_PPG                                ((FM_BT_PPG_TypeDef *)FM0P_BT4_BASE)
#define FM0P_BT4_PWC                              ((FM_BT_PWC_TypeDef *)FM0P_BT4_BASE)
#define FM_BT4_PWC                                ((FM_BT_PWC_TypeDef *)FM0P_BT4_BASE)
#define FM0P_BT4_PWM                              ((FM_BT_PWM_TypeDef *)FM0P_BT4_BASE)
#define FM_BT4_PWM                                ((FM_BT_PWM_TypeDef *)FM0P_BT4_BASE)
#define FM0P_BT4_RT                               ((FM_BT_RT_TypeDef *)FM0P_BT4_BASE)
#define FM_BT4_RT                                 ((FM_BT_RT_TypeDef *)FM0P_BT4_BASE)
#define FM0P_BT5                                  ((FM_BT_TypeDef *)FM0P_BT5_BASE)
#define FM_BT5                                    ((FM_BT_TypeDef *)FM0P_BT5_BASE)
#define FM0P_BT5_PPG                              ((FM_BT_PPG_TypeDef *)FM0P_BT5_BASE)
#define FM_BT5_PPG                                ((FM_BT_PPG_TypeDef *)FM0P_BT5_BASE)
#define FM0P_BT5_PWC                              ((FM_BT_PWC_TypeDef *)FM0P_BT5_BASE)
#define FM_BT5_PWC                                ((FM_BT_PWC_TypeDef *)FM0P_BT5_BASE)
#define FM0P_BT5_PWM                              ((FM_BT_PWM_TypeDef *)FM0P_BT5_BASE)
#define FM_BT5_PWM                                ((FM_BT_PWM_TypeDef *)FM0P_BT5_BASE)
#define FM0P_BT5_RT                               ((FM_BT_RT_TypeDef *)FM0P_BT5_BASE)
#define FM_BT5_RT                                 ((FM_BT_RT_TypeDef *)FM0P_BT5_BASE)
#define FM0P_BT6                                  ((FM_BT_TypeDef *)FM0P_BT6_BASE)
#define FM_BT6                                    ((FM_BT_TypeDef *)FM0P_BT6_BASE)
#define FM0P_BT6_PPG                              ((FM_BT_PPG_TypeDef *)FM0P_BT6_BASE)
#define FM_BT6_PPG                                ((FM_BT_PPG_TypeDef *)FM0P_BT6_BASE)
#define FM0P_BT6_PWC                              ((FM_BT_PWC_TypeDef *)FM0P_BT6_BASE)
#define FM_BT6_PWC                                ((FM_BT_PWC_TypeDef *)FM0P_BT6_BASE)
#define FM0P_BT6_PWM                              ((FM_BT_PWM_TypeDef *)FM0P_BT6_BASE)
#define FM_BT6_PWM                                ((FM_BT_PWM_TypeDef *)FM0P_BT6_BASE)
#define FM0P_BT6_RT                               ((FM_BT_RT_TypeDef *)FM0P_BT6_BASE)
#define FM_BT6_RT                                 ((FM_BT_RT_TypeDef *)FM0P_BT6_BASE)
#define FM0P_BT7                                  ((FM_BT_TypeDef *)FM0P_BT7_BASE)
#define FM_BT7                                    ((FM_BT_TypeDef *)FM0P_BT7_BASE)
#define FM0P_BT7_PPG                              ((FM_BT_PPG_TypeDef *)FM0P_BT7_BASE)
#define FM_BT7_PPG                                ((FM_BT_PPG_TypeDef *)FM0P_BT7_BASE)
#define FM0P_BT7_PWC                              ((FM_BT_PWC_TypeDef *)FM0P_BT7_BASE)
#define FM_BT7_PWC                                ((FM_BT_PWC_TypeDef *)FM0P_BT7_BASE)
#define FM0P_BT7_PWM                              ((FM_BT_PWM_TypeDef *)FM0P_BT7_BASE)
#define FM_BT7_PWM                                ((FM_BT_PWM_TypeDef *)FM0P_BT7_BASE)
#define FM0P_BT7_RT                               ((FM_BT_RT_TypeDef *)FM0P_BT7_BASE)
#define FM_BT7_RT                                 ((FM_BT_RT_TypeDef *)FM0P_BT7_BASE)
#define FM0P_BTIOSEL03                            ((FM_BTIOSEL03_TypeDef *)FM0P_BTIOSEL03_BASE)
#define FM_BTIOSEL03                              ((FM_BTIOSEL03_TypeDef *)FM0P_BTIOSEL03_BASE)
#define FM0P_BTIOSEL47                            ((FM_BTIOSEL47_TypeDef *)FM0P_BTIOSEL47_BASE)
#define FM_BTIOSEL47                              ((FM_BTIOSEL47_TypeDef *)FM0P_BTIOSEL47_BASE)
#define FM0P_CLK_GATING                           ((FM_CLK_GATING_TypeDef *)FM0P_CLK_GATING_BASE)
#define FM_CLK_GATING                             ((FM_CLK_GATING_TypeDef *)FM0P_CLK_GATING_BASE)
#define FM0P_CRC                                  ((FM_CRC_TypeDef *)FM0P_CRC_BASE)
#define FM_CRC                                    ((FM_CRC_TypeDef *)FM0P_CRC_BASE)
#define FM0P_CRG                                  ((FM_CRG_TypeDef *)FM0P_CRG_BASE)
#define FM_CRG                                    ((FM_CRG_TypeDef *)FM0P_CRG_BASE)
#define FM0P_CRTRIM                               ((FM_CRTRIM_TypeDef *)FM0P_CRTRIM_BASE)
#define FM_CRTRIM                                 ((FM_CRTRIM_TypeDef *)FM0P_CRTRIM_BASE)
#define FM0P_DS                                   ((FM_DS_TypeDef *)FM0P_DS_BASE)
#define FM_DS                                     ((FM_DS_TypeDef *)FM0P_DS_BASE)
#define FM0P_DSTC                                 ((FM_DSTC_TypeDef *)FM0P_DSTC_BASE)
#define FM_DSTC                                   ((FM_DSTC_TypeDef *)FM0P_DSTC_BASE)
#define FM0P_DT                                   ((FM_DT_TypeDef *)FM0P_DT_BASE)
#define FM_DT                                     ((FM_DT_TypeDef *)FM0P_DT_BASE)
#define FM0P_EXTI                                 ((FM_EXTI_TypeDef *)FM0P_EXTI_BASE)
#define FM_EXTI                                   ((FM_EXTI_TypeDef *)FM0P_EXTI_BASE)
#define FM0P_FASTIO                               ((FM_FASTIO_TypeDef *)FM0P_FASTIO_BASE)
#define FM_FASTIO                                 ((FM_FASTIO_TypeDef *)FM0P_FASTIO_BASE)
#define FM0P_FLASH_IF                             ((FM_FLASH_IF_TypeDef *)FM0P_FLASH_IF_BASE)
#define FM_FLASH_IF                               ((FM_FLASH_IF_TypeDef *)FM0P_FLASH_IF_BASE)
#define FM0P_GPIO                                 ((FM_GPIO_TypeDef *)FM0P_GPIO_BASE)
#define FM_GPIO                                   ((FM_GPIO_TypeDef *)FM0P_GPIO_BASE)
#define FM0P_HDMICEC0                             ((FM_HDMICEC_TypeDef *)FM0P_HDMICEC0_BASE)
#define FM_HDMICEC0                               ((FM_HDMICEC_TypeDef *)FM0P_HDMICEC0_BASE)
#define FM0P_HDMICEC1                             ((FM_HDMICEC_TypeDef *)FM0P_HDMICEC1_BASE)
#define FM_HDMICEC1                               ((FM_HDMICEC_TypeDef *)FM0P_HDMICEC1_BASE)
#define FM0P_HWWDT                                ((FM_HWWDT_TypeDef *)FM0P_HWWDT_BASE)
#define FM_HWWDT                                  ((FM_HWWDT_TypeDef *)FM0P_HWWDT_BASE)
#define FM0P_I2CSLAVE                             ((FM_I2CSLAVE_TypeDef *)FM0P_I2CSLAVE_BASE)
#define FM_I2CSLAVE                               ((FM_I2CSLAVE_TypeDef *)FM0P_I2CSLAVE_BASE)
#define FM0P_INTREQ                               ((FM_INTREQ_TypeDef *)FM0P_INTREQ_BASE)
#define FM_INTREQ                                 ((FM_INTREQ_TypeDef *)FM0P_INTREQ_BASE)
#define FM0P_LSCRP                                ((FM_LSCRP_TypeDef *)FM0P_LSCRP_BASE)
#define FM_LSCRP                                  ((FM_LSCRP_TypeDef *)FM0P_LSCRP_BASE)
#define FM0P_LVD                                  ((FM_LVD_TypeDef *)FM0P_LVD_BASE)
#define FM_LVD                                    ((FM_LVD_TypeDef *)FM0P_LVD_BASE)
#define FM0P_MFS0                                 ((FM_MFS_TypeDef *)FM0P_MFS0_BASE)
#define FM_MFS0                                   ((FM_MFS_TypeDef *)FM0P_MFS0_BASE)
#define FM0P_MFS0_CSIO                            ((FM_MFS_CSIO_TypeDef *)FM0P_MFS0_BASE)
#define FM_MFS0_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM0P_MFS0_BASE)
#define FM0P_MFS0_I2C                             ((FM_MFS_I2C_TypeDef *)FM0P_MFS0_BASE)
#define FM_MFS0_I2C                               ((FM_MFS_I2C_TypeDef *)FM0P_MFS0_BASE)
#define FM0P_MFS0_LIN                             ((FM_MFS_LIN_TypeDef *)FM0P_MFS0_BASE)
#define FM_MFS0_LIN                               ((FM_MFS_LIN_TypeDef *)FM0P_MFS0_BASE)
#define FM0P_MFS0_UART                            ((FM_MFS_UART_TypeDef *)FM0P_MFS0_BASE)
#define FM_MFS0_UART                              ((FM_MFS_UART_TypeDef *)FM0P_MFS0_BASE)
#define FM0P_MFS1                                 ((FM_MFS_TypeDef *)FM0P_MFS1_BASE)
#define FM_MFS1                                   ((FM_MFS_TypeDef *)FM0P_MFS1_BASE)
#define FM0P_MFS1_CSIO                            ((FM_MFS_CSIO_TypeDef *)FM0P_MFS1_BASE)
#define FM_MFS1_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM0P_MFS1_BASE)
#define FM0P_MFS1_I2C                             ((FM_MFS_I2C_TypeDef *)FM0P_MFS1_BASE)
#define FM_MFS1_I2C                               ((FM_MFS_I2C_TypeDef *)FM0P_MFS1_BASE)
#define FM0P_MFS1_LIN                             ((FM_MFS_LIN_TypeDef *)FM0P_MFS1_BASE)
#define FM_MFS1_LIN                               ((FM_MFS_LIN_TypeDef *)FM0P_MFS1_BASE)
#define FM0P_MFS1_UART                            ((FM_MFS_UART_TypeDef *)FM0P_MFS1_BASE)
#define FM_MFS1_UART                              ((FM_MFS_UART_TypeDef *)FM0P_MFS1_BASE)
#define FM0P_MFS3                                 ((FM_MFS_TypeDef *)FM0P_MFS3_BASE)
#define FM_MFS3                                   ((FM_MFS_TypeDef *)FM0P_MFS3_BASE)
#define FM0P_MFS3_CSIO                            ((FM_MFS_CSIO_TypeDef *)FM0P_MFS3_BASE)
#define FM_MFS3_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM0P_MFS3_BASE)
#define FM0P_MFS3_I2C                             ((FM_MFS_I2C_TypeDef *)FM0P_MFS3_BASE)
#define FM_MFS3_I2C                               ((FM_MFS_I2C_TypeDef *)FM0P_MFS3_BASE)
#define FM0P_MFS3_LIN                             ((FM_MFS_LIN_TypeDef *)FM0P_MFS3_BASE)
#define FM_MFS3_LIN                               ((FM_MFS_LIN_TypeDef *)FM0P_MFS3_BASE)
#define FM0P_MFS3_UART                            ((FM_MFS_UART_TypeDef *)FM0P_MFS3_BASE)
#define FM_MFS3_UART                              ((FM_MFS_UART_TypeDef *)FM0P_MFS3_BASE)
#define FM0P_MFS4                                 ((FM_MFS_TypeDef *)FM0P_MFS4_BASE)
#define FM_MFS4                                   ((FM_MFS_TypeDef *)FM0P_MFS4_BASE)
#define FM0P_MFS4_CSIO                            ((FM_MFS_CSIO_TypeDef *)FM0P_MFS4_BASE)
#define FM_MFS4_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM0P_MFS4_BASE)
#define FM0P_MFS4_I2C                             ((FM_MFS_I2C_TypeDef *)FM0P_MFS4_BASE)
#define FM_MFS4_I2C                               ((FM_MFS_I2C_TypeDef *)FM0P_MFS4_BASE)
#define FM0P_MFS4_I2S                             ((FM_MFS_I2S_TypeDef *)FM0P_MFS4_BASE)
#define FM_MFS4_I2S                               ((FM_MFS_I2S_TypeDef *)FM0P_MFS4_BASE)
#define FM0P_MFS4_LIN                             ((FM_MFS_LIN_TypeDef *)FM0P_MFS4_BASE)
#define FM_MFS4_LIN                               ((FM_MFS_LIN_TypeDef *)FM0P_MFS4_BASE)
#define FM0P_MFS4_UART                            ((FM_MFS_UART_TypeDef *)FM0P_MFS4_BASE)
#define FM_MFS4_UART                              ((FM_MFS_UART_TypeDef *)FM0P_MFS4_BASE)
#define FM0P_MFS6                                 ((FM_MFS_TypeDef *)FM0P_MFS6_BASE)
#define FM_MFS6                                   ((FM_MFS_TypeDef *)FM0P_MFS6_BASE)
#define FM0P_MFS6_CSIO                            ((FM_MFS_CSIO_TypeDef *)FM0P_MFS6_BASE)
#define FM_MFS6_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM0P_MFS6_BASE)
#define FM0P_MFS6_I2C                             ((FM_MFS_I2C_TypeDef *)FM0P_MFS6_BASE)
#define FM_MFS6_I2C                               ((FM_MFS_I2C_TypeDef *)FM0P_MFS6_BASE)
#define FM0P_MFS6_I2S                             ((FM_MFS_I2S_TypeDef *)FM0P_MFS6_BASE)
#define FM_MFS6_I2S                               ((FM_MFS_I2S_TypeDef *)FM0P_MFS6_BASE)
#define FM0P_MFS6_LIN                             ((FM_MFS_LIN_TypeDef *)FM0P_MFS6_BASE)
#define FM_MFS6_LIN                               ((FM_MFS_LIN_TypeDef *)FM0P_MFS6_BASE)
#define FM0P_MFS6_UART                            ((FM_MFS_UART_TypeDef *)FM0P_MFS6_BASE)
#define FM_MFS6_UART                              ((FM_MFS_UART_TypeDef *)FM0P_MFS6_BASE)
#define FM0P_MFS7                                 ((FM_MFS_TypeDef *)FM0P_MFS7_BASE)
#define FM_MFS7                                   ((FM_MFS_TypeDef *)FM0P_MFS7_BASE)
#define FM0P_MFS7_CSIO                            ((FM_MFS_CSIO_TypeDef *)FM0P_MFS7_BASE)
#define FM_MFS7_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM0P_MFS7_BASE)
#define FM0P_MFS7_I2C                             ((FM_MFS_I2C_TypeDef *)FM0P_MFS7_BASE)
#define FM_MFS7_I2C                               ((FM_MFS_I2C_TypeDef *)FM0P_MFS7_BASE)
#define FM0P_MFS7_LIN                             ((FM_MFS_LIN_TypeDef *)FM0P_MFS7_BASE)
#define FM_MFS7_LIN                               ((FM_MFS_LIN_TypeDef *)FM0P_MFS7_BASE)
#define FM0P_MFS7_UART                            ((FM_MFS_UART_TypeDef *)FM0P_MFS7_BASE)
#define FM_MFS7_UART                              ((FM_MFS_UART_TypeDef *)FM0P_MFS7_BASE)
#define FM0P_MFSI2S0                              ((FM_MFSI2S_TypeDef *)FM0P_MFSI2S0_BASE)
#define FM_MFSI2S0                                ((FM_MFSI2S_TypeDef *)FM0P_MFSI2S0_BASE)
#define FM0P_MFSI2S1                              ((FM_MFSI2S_TypeDef *)FM0P_MFSI2S1_BASE)
#define FM_MFSI2S1                                ((FM_MFSI2S_TypeDef *)FM0P_MFSI2S1_BASE)
#define FM0P_MTB_DWT                              ((FM_MTB_DWT_TypeDef *)FM0P_MTB_DWT_BASE)
#define FM_MTB_DWT                                ((FM_MTB_DWT_TypeDef *)FM0P_MTB_DWT_BASE)
#define FM0P_RTC                                  ((FM_RTC_TypeDef *)FM0P_RTC_BASE)
#define FM_RTC                                    ((FM_RTC_TypeDef *)FM0P_RTC_BASE)
#define FM0P_SBSSR                                ((FM_SBSSR_TypeDef *)FM0P_SBSSR_BASE)
#define FM_SBSSR                                  ((FM_SBSSR_TypeDef *)FM0P_SBSSR_BASE)
#define FM0P_SMCIF1                               ((FM_SMCIF_TypeDef *)FM0P_SMCIF1_BASE)
#define FM_SMCIF1                                 ((FM_SMCIF_TypeDef *)FM0P_SMCIF1_BASE)
#define FM0P_SWWDT                                ((FM_SWWDT_TypeDef *)FM0P_SWWDT_BASE)
#define FM_SWWDT                                  ((FM_SWWDT_TypeDef *)FM0P_SWWDT_BASE)
#define FM0P_UNIQUE_ID                            ((FM_UNIQUE_ID_TypeDef *)FM0P_UNIQUE_ID_BASE)
#define FM_UNIQUE_ID                              ((FM_UNIQUE_ID_TypeDef *)FM0P_UNIQUE_ID_BASE)
#define FM0P_VIR                                  ((FM_VIR_TypeDef *)FM0P_VIR_BASE)
#define FM_VIR                                    ((FM_VIR_TypeDef *)FM0P_VIR_BASE)
#define FM0P_WC                                   ((FM_WC_TypeDef *)FM0P_WC_BASE)
#define FM_WC                                     ((FM_WC_TypeDef *)FM0P_WC_BASE)
/*******************************************************************************
* Register Definitions
*******************************************************************************/
/*******************************************************************************
* ADC Registers ADC0
*   Register Definition
*******************************************************************************/
#define FM_ADC0_ADSR                              *((volatile  uint8_t*)(0x40027000UL))
#define FM0P_ADC0_ADSR                            *((volatile  uint8_t*)(0x40027000UL))
#define FM_ADC0_ADCR                              *((volatile  uint8_t*)(0x40027001UL))
#define FM0P_ADC0_ADCR                            *((volatile  uint8_t*)(0x40027001UL))
#define FM_ADC0_SFNS                              *((volatile  uint8_t*)(0x40027008UL))
#define FM0P_ADC0_SFNS                            *((volatile  uint8_t*)(0x40027008UL))
#define FM_ADC0_SCCR                              *((volatile  uint8_t*)(0x40027009UL))
#define FM0P_ADC0_SCCR                            *((volatile  uint8_t*)(0x40027009UL))
#define FM_ADC0_SCFD                              *((volatile uint32_t*)(0x4002700CUL))
#define FM0P_ADC0_SCFD                            *((volatile uint32_t*)(0x4002700CUL))
#define FM_ADC0_SCFD_FDAS1                        *((volatile uint32_t*)(0x4002700CUL))
#define FM0P_ADC0_SCFD_FDAS1                      *((volatile uint32_t*)(0x4002700CUL))
#define FM_ADC0_SCIS23                            *((volatile uint16_t*)(0x40027010UL))
#define FM0P_ADC0_SCIS23                          *((volatile uint16_t*)(0x40027010UL))
#define FM_ADC0_SCIS01                            *((volatile uint16_t*)(0x40027014UL))
#define FM0P_ADC0_SCIS01                          *((volatile uint16_t*)(0x40027014UL))
#define FM_ADC0_PFNS                              *((volatile  uint8_t*)(0x40027018UL))
#define FM0P_ADC0_PFNS                            *((volatile  uint8_t*)(0x40027018UL))
#define FM_ADC0_PCCR                              *((volatile  uint8_t*)(0x40027019UL))
#define FM0P_ADC0_PCCR                            *((volatile  uint8_t*)(0x40027019UL))
#define FM_ADC0_PCFD                              *((volatile uint32_t*)(0x4002701CUL))
#define FM0P_ADC0_PCFD                            *((volatile uint32_t*)(0x4002701CUL))
#define FM_ADC0_PCFD_FDAS1                        *((volatile uint32_t*)(0x4002701CUL))
#define FM0P_ADC0_PCFD_FDAS1                      *((volatile uint32_t*)(0x4002701CUL))
#define FM_ADC0_PCIS                              *((volatile  uint8_t*)(0x40027020UL))
#define FM0P_ADC0_PCIS                            *((volatile  uint8_t*)(0x40027020UL))
#define FM_ADC0_CMPCR                             *((volatile  uint8_t*)(0x40027024UL))
#define FM0P_ADC0_CMPCR                           *((volatile  uint8_t*)(0x40027024UL))
#define FM_ADC0_CMPD                              *((volatile uint16_t*)(0x40027026UL))
#define FM0P_ADC0_CMPD                            *((volatile uint16_t*)(0x40027026UL))
#define FM_ADC0_ADSS23                            *((volatile uint16_t*)(0x40027028UL))
#define FM0P_ADC0_ADSS23                          *((volatile uint16_t*)(0x40027028UL))
#define FM_ADC0_ADSS01                            *((volatile uint16_t*)(0x4002702CUL))
#define FM0P_ADC0_ADSS01                          *((volatile uint16_t*)(0x4002702CUL))
#define FM_ADC0_ADST01                            *((volatile uint16_t*)(0x40027030UL))
#define FM0P_ADC0_ADST01                          *((volatile uint16_t*)(0x40027030UL))
#define FM_ADC0_ADCT                              *((volatile  uint8_t*)(0x40027034UL))
#define FM0P_ADC0_ADCT                            *((volatile  uint8_t*)(0x40027034UL))
#define FM_ADC0_PRTSL                             *((volatile  uint8_t*)(0x40027038UL))
#define FM0P_ADC0_PRTSL                           *((volatile  uint8_t*)(0x40027038UL))
#define FM_ADC0_SCTSL                             *((volatile  uint8_t*)(0x40027039UL))
#define FM0P_ADC0_SCTSL                           *((volatile  uint8_t*)(0x40027039UL))
#define FM_ADC0_ADCEN                             *((volatile uint16_t*)(0x4002703CUL))
#define FM0P_ADC0_ADCEN                           *((volatile uint16_t*)(0x4002703CUL))
#define FM_ADC0_WCMRCIF                           *((volatile uint32_t*)(0x40027044UL))
#define FM0P_ADC0_WCMRCIF                         *((volatile uint32_t*)(0x40027044UL))
#define FM_ADC0_WCMRCOT                           *((volatile uint32_t*)(0x40027048UL))
#define FM0P_ADC0_WCMRCOT                         *((volatile uint32_t*)(0x40027048UL))
#define FM_ADC0_WCMPCR                            *((volatile  uint8_t*)(0x4002704CUL))
#define FM0P_ADC0_WCMPCR                          *((volatile  uint8_t*)(0x4002704CUL))
#define FM_ADC0_WCMPSR                            *((volatile  uint8_t*)(0x4002704DUL))
#define FM0P_ADC0_WCMPSR                          *((volatile  uint8_t*)(0x4002704DUL))
#define FM_ADC0_WCMPDL                            *((volatile uint16_t*)(0x40027050UL))
#define FM0P_ADC0_WCMPDL                          *((volatile uint16_t*)(0x40027050UL))
#define FM_ADC0_WCMPDH                            *((volatile uint16_t*)(0x40027052UL))
#define FM0P_ADC0_WCMPDH                          *((volatile uint16_t*)(0x40027052UL))

