MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C12C0AGN20000/mcu.h
#define bFM_SMCIF1_STATUS_TXEMP                   *((volatile  uint16_t*)(0x42793080UL))
#define bFM0P_SMCIF1_STATUS_TXEMP                 *((volatile  uint16_t*)(0x42793080UL))
#define bFM_SMCIF1_STATUS_RXFUL                   *((volatile  uint16_t*)(0x42793084UL))
#define bFM0P_SMCIF1_STATUS_RXFUL                 *((volatile  uint16_t*)(0x42793084UL))
#define bFM_SMCIF1_STATUS_RXACT                   *((volatile  uint16_t*)(0x42793088UL))
#define bFM0P_SMCIF1_STATUS_RXACT                 *((volatile  uint16_t*)(0x42793088UL))
#define bFM_SMCIF1_STATUS_TXACT                   *((volatile  uint16_t*)(0x4279308CUL))
#define bFM0P_SMCIF1_STATUS_TXACT                 *((volatile  uint16_t*)(0x4279308CUL))
#define bFM_SMCIF1_STATUS_CARDDETECT              *((volatile  uint16_t*)(0x42793090UL))
#define bFM0P_SMCIF1_STATUS_CARDDETECT            *((volatile  uint16_t*)(0x42793090UL))
#define bFM_SMCIF1_STATUS_CARDEVENT               *((volatile  uint16_t*)(0x42793094UL))
#define bFM0P_SMCIF1_STATUS_CARDEVENT             *((volatile  uint16_t*)(0x42793094UL))
#define bFM_SMCIF1_STATUS_RECOFL                  *((volatile  uint16_t*)(0x42793098UL))
#define bFM0P_SMCIF1_STATUS_RECOFL                *((volatile  uint16_t*)(0x42793098UL))
#define bFM_SMCIF1_STATUS_IDTRUN                  *((volatile  uint16_t*)(0x4279309CUL))
#define bFM0P_SMCIF1_STATUS_IDTRUN                *((volatile  uint16_t*)(0x4279309CUL))
#define bFM_SMCIF1_STATUS_RDFIFOOVR               *((volatile  uint16_t*)(0x427930A0UL))
#define bFM0P_SMCIF1_STATUS_RDFIFOOVR             *((volatile  uint16_t*)(0x427930A0UL))
#define bFM_SMCIF1_STATUS_RDFIFOFUL               *((volatile  uint16_t*)(0x427930A4UL))
#define bFM0P_SMCIF1_STATUS_RDFIFOFUL             *((volatile  uint16_t*)(0x427930A4UL))
#define bFM_SMCIF1_STATUS_WRFIFOEMP               *((volatile  uint16_t*)(0x427930A8UL))
#define bFM0P_SMCIF1_STATUS_WRFIFOEMP             *((volatile  uint16_t*)(0x427930A8UL))
#define bFM_SMCIF1_STATUS_RXSTARTERR              *((volatile  uint16_t*)(0x427930ACUL))
#define bFM0P_SMCIF1_STATUS_RXSTARTERR            *((volatile  uint16_t*)(0x427930ACUL))
#define bFM_SMCIF1_STATUS_TXRESEND                *((volatile  uint16_t*)(0x427930B0UL))
#define bFM0P_SMCIF1_STATUS_TXRESEND              *((volatile  uint16_t*)(0x427930B0UL))
#define bFM_SMCIF1_STATUS_RXRESEND                *((volatile  uint16_t*)(0x427930B4UL))
#define bFM0P_SMCIF1_STATUS_RXRESEND              *((volatile  uint16_t*)(0x427930B4UL))


/*******************************************************************************
* SWWDT Registers SWWDT
*   Bitband Section
*******************************************************************************/
#define bFM_SWWDT_WDOGCONTROL_INTEN               *((volatile  uint32_t*)(0x42240100UL))
#define bFM0P_SWWDT_WDOGCONTROL_INTEN             *((volatile  uint32_t*)(0x42240100UL))
#define bFM_SWWDT_WDOGCONTROL_RESEN               *((volatile  uint32_t*)(0x42240104UL))
#define bFM0P_SWWDT_WDOGCONTROL_RESEN             *((volatile  uint32_t*)(0x42240104UL))
#define bFM_SWWDT_WDOGCONTROL_SPM                 *((volatile  uint32_t*)(0x42240110UL))
#define bFM0P_SWWDT_WDOGCONTROL_SPM               *((volatile  uint32_t*)(0x42240110UL))

#define bFM_SWWDT_WDOGRIS_RIS                     *((volatile  uint32_t*)(0x42240200UL))
#define bFM0P_SWWDT_WDOGRIS_RIS                   *((volatile  uint32_t*)(0x42240200UL))

#define bFM_SWWDT_WDOGSPMC_TGR                    *((volatile  uint32_t*)(0x42240300UL))
#define bFM0P_SWWDT_WDOGSPMC_TGR                  *((volatile  uint32_t*)(0x42240300UL))


/*******************************************************************************
* UNIQUE_ID Registers UNIQUE_ID
*   Bitband Section
*******************************************************************************/

/*******************************************************************************
* VIR Registers VIR
*   Bitband Section
*******************************************************************************/

/*******************************************************************************
* WC Registers WC
*   Bitband Section
*******************************************************************************/
#define bFM_WC_CLK_EN_CLK_EN                      *((volatile  uint8_t *)(0x42740280UL))
#define bFM0P_WC_CLK_EN_CLK_EN                    *((volatile  uint8_t *)(0x42740280UL))
#define bFM_WC_CLK_EN_CLK_EN_R                    *((volatile  uint8_t *)(0x42740284UL))
#define bFM0P_WC_CLK_EN_CLK_EN_R                  *((volatile  uint8_t *)(0x42740284UL))

#define bFM_WC_WCCR_WCIF                          *((volatile  uint8_t *)(0x42740040UL))
#define bFM0P_WC_WCCR_WCIF                        *((volatile  uint8_t *)(0x42740040UL))
#define bFM_WC_WCCR_WCIE                          *((volatile  uint8_t *)(0x42740044UL))
#define bFM0P_WC_WCCR_WCIE                        *((volatile  uint8_t *)(0x42740044UL))
#define bFM_WC_WCCR_WCOP                          *((volatile  uint8_t *)(0x42740058UL))
#define bFM0P_WC_WCCR_WCOP                        *((volatile  uint8_t *)(0x42740058UL))
#define bFM_WC_WCCR_WCEN                          *((volatile  uint8_t *)(0x4274005CUL))
#define bFM0P_WC_WCCR_WCEN                        *((volatile  uint8_t *)(0x4274005CUL))


#if defined __cplusplus
}
#endif

#endif /* _S6E1C1XC_H_ */
